IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/radio_test/src/radio_cmd.c
/**
 * Copyright (c) 2018 - 2019, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include <stdlib.h>
#include "nrf_cli.h"
#include "radio_test.h"

#if defined(NRF52832_XXAA) || defined(NRF52833_XXAA)
    #define TOGGLE_DCDC_HELP \
    "Toggle DCDC state <state>, if state = 1 then DC/DC converter is enabled"
#else
    #define TOGGLE_DCDC_HELP                                       \
    "Toggle DCDC state <state>, "                                  \
    "if state = 1 then toggle DC/DC REG1 state, or if state = 0 "  \
    "then toggle DC/DC REG0 state"
#endif

extern volatile transmit_pattern_t g_pattern;                           /**< Radio transmission pattern. */
extern          uint8_t            g_rx_packet[RADIO_MAX_PAYLOAD_LEN];  /**< Buffer for the radio RX packet. */ 

static uint8_t  m_mode          = RADIO_MODE_MODE_Ble_1Mbit;  /**< Radio mode. Data rate and modulation. */
static uint8_t  m_txpower       = RADIO_TXPOWER_TXPOWER_0dBm; /**< Radio output power. */
static uint8_t  m_channel_start = 0;                          /**< Radio start channel (frequency). */
static uint8_t  m_channel_end   = 80;                         /**< Radio end channel (frequency). */
static uint32_t m_delay_ms      = 10;                         /**< Delay time in milliseconds. */
static uint32_t m_duty_cycle    = 50;                         /**< Duty cycle. */
static bool     m_sweep         = false;                      /**< If true, RX or TX channel is sweeped. */


/**
 * @brief Function for printing the received payload.
 *
 * @param[in] mode       Radio mode. Data rate and modulation.
 * @param[in] p_cli      Pointer to the CLI instance.
 */
 static void radio_print_rx(nrf_cli_t const * p_cli, uint8_t mode)
{
    size_t size;
#if defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
    if (mode == RADIO_MODE_MODE_Ieee802154_250Kbit)
    {
        size = IEEE_MAX_PAYLOAD_LEN;
    }
    else
    {
        size = sizeof(g_rx_packet);
    }
#else
    size = sizeof(g_rx_packet);
#endif // defined(NRF52840_XXAA) || defined(NRF52833_XXAA)

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Received payload:\r\n");

    for (uint32_t i = 0; i < size; i++)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Data: %d\r\n", g_rx_packet[i]);
    }
};


#if defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
static void ieee_channel_check(nrf_cli_t const * p_cli, uint8_t channel)
{
    if (m_mode == RADIO_MODE_MODE_Ieee802154_250Kbit)
    {
        if ((channel < IEEE_MIN_CHANNEL) || (channel > IEEE_MAX_CHANNEL))
        {
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_ERROR, 
                            "For %s mode channel must be between %d and %d.\r\n",
                            STRINGIFY_(RADIO_MODE_MODE_Ieee802154_250Kbit),
                            IEEE_MIN_CHANNEL,
                            IEEE_MAX_CHANNEL);

            nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Channel set to %d.\r\n", IEEE_MIN_CHANNEL);
        }

    }
}
#endif // defined(NRF52840_XXAA) || defined(NRF52833_XXAA)


static void cmd_start_channel_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: bad parameters count.\r\n", argv[0]);
        return;
    }

    uint32_t channel;

    channel = atoi(argv[1]);

    if (channel > 80)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Channel must be between 0 and 80.\r\n");
        return;
    }

    m_channel_start = (uint8_t)channel;

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Start channel set to: %d.\r\n", channel);
}


static void cmd_end_channel_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: bad parameters count.\r\n", argv[0]);
        return;
    }

    uint32_t channel;

    channel = atoi(argv[1]);

