IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/radio_test/src/radio_cmd.c
    if (channel > 80)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Channel must be between 0 and 80.\r\n");
        return;
    }

    m_channel_end = (uint8_t)channel;

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "End channel set to: %d.\r\n", channel);
}


static void cmd_time_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: bad parameters count.\r\n", argv[0]);
        return;
    }

    uint32_t time;

    time = atoi(argv[1]);

    if (time > 99)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Delay time must be between 0 and 99 ms.\r\n");
        return;
    }

    m_delay_ms = time;

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Delay time set to: %d.\r\n", time);
}


static void cmd_cancel(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    radio_sweep_end();
}


static void cmd_data_rate_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: bad parameters count.\r\n", argv[0]);
        return;
    }

    if (argc == 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Uknown argument: %s.\r\n", argv[1]);
    }
}


static void cmd_tx_carrier_start(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (m_sweep)
    {
        radio_sweep_end();
        m_sweep = false;
    }

#if defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
    ieee_channel_check(p_cli, m_channel_start);
#endif // defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
    radio_unmodulated_tx_carrier(m_txpower, m_mode, m_channel_start);

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Start the TX carrier.\r\n");
}


static void cmd_tx_modulated_carrier_start(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (m_sweep)
    {
        radio_sweep_end();
        m_sweep = false;
    }

#if defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
    ieee_channel_check(p_cli, m_channel_start);
#endif // defined(NRF52840_XXAA) || defined(NRF52833_XXAA) 
    radio_modulated_tx_carrier(m_txpower, m_mode, m_channel_start);

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Start the modulated TX carrier.\r\n");
}


static void cmd_duty_cycle_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: bad parameters count.\r\n", argv[0]);
        return;
    }

    uint32_t duty_cycle;

    duty_cycle = atoi(argv[1]);

    if (duty_cycle > 100)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Duty cycle must be between 1 and 99.\r\n");
        return;
    }

    m_duty_cycle = duty_cycle;

#if defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
    ieee_channel_check(p_cli, m_channel_start);
#endif // defined(NRF52840_XXAA) || defined(NRF52833_XXAA) 
    radio_modulated_tx_carrier_duty_cycle(m_txpower, m_mode, m_channel_start, (uint8_t)m_duty_cycle);
}


static void cmd_output_power_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: bad parameters count.\r\n", argv[0]);
    }

    if (argc == 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Uknown argument: %s.\r\n", argv[1]);
    }
}


#if defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
static void cmd_pos8dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Pos8dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos8dBm));
}


static void cmd_pos7dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Pos7dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos7dBm));
}


static void cmd_pos6dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Pos6dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos6dBm));
}


static void cmd_pos5dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Pos5dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos5dBm));
}


static void cmd_pos2dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Pos2dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos2dBm));
}


#endif // defined(NRF52840_XXAA) || defined(NRF52833_XXAA)


static void cmd_pos3dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Pos3dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos3dBm));
}


static void cmd_pos4dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Pos4dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos4dBm));
}


static void cmd_pos0dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_0dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n", 
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_0dBm));
}


static void cmd_neg4dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Neg4dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Neg4dBm));
}


static void cmd_neg8dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Neg8dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Neg8dBm));
}


static void cmd_neg12dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Neg12dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Neg12dBm));
}


static void cmd_neg16dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Neg16dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Neg16dBm));
}


