IOsonata/IOsonata/ARM/Nordic/nRF52/nRF52840/exemples/radio_test/src/radio_cmd.c
static void cmd_neg20dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Neg20dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Neg20dBm));
}


static void cmd_neg30dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Neg30dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Neg30dBm));
}


static void cmd_neg40dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_txpower = RADIO_TXPOWER_TXPOWER_Neg40dBm;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(RADIO_TXPOWER_TXPOWER_Neg40dBm));
}


static void cmd_transmit_pattern_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: bad parameters count.\r\n", argv[0]);
        return;
    }

    if (argc == 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Uknown argument: %s.\r\n", argv[1]);
    }
}


static void cmd_print(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Parameters:\r\n");

    switch (m_mode)
    {
#ifdef NRF52832_XXAA
        case RADIO_MODE_MODE_Nrf_250Kbit:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(RADIO_MODE_MODE_Nrf_250Kbit));
            break;

#endif // NRF52832_XXAA
        case RADIO_MODE_MODE_Nrf_1Mbit:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(RADIO_MODE_MODE_Nrf_1Mbit));
            break;

        case RADIO_MODE_MODE_Nrf_2Mbit:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(RADIO_MODE_MODE_Nrf_2Mbit));
            break;

        case RADIO_MODE_MODE_Ble_1Mbit:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(RADIO_MODE_MODE_Ble_1Mbit));
            break;

        case RADIO_MODE_MODE_Ble_2Mbit:
            nrf_cli_fprintf(p_cli,
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(RADIO_MODE_MODE_Ble_2Mbit));
            break;

#if defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
        case RADIO_MODE_MODE_Ble_LR125Kbit:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(RADIO_MODE_MODE_Ble_LR125Kbit));
            break;

        case RADIO_MODE_MODE_Ble_LR500Kbit:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(RADIO_MODE_MODE_Ble_LR500Kbit));
            break;

        case RADIO_MODE_MODE_Ieee802154_250Kbit:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(RADIO_MODE_MODE_Ieee802154_250Kbit));
            break;

#endif // defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
        default:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate unknown or deprecated: %lu\n\r", 
                            m_mode);
            break;
    }

    switch (m_txpower)
    {
#if defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
        case RADIO_TXPOWER_TXPOWER_Pos8dBm:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos8dBm));
            break;

        case RADIO_TXPOWER_TXPOWER_Pos7dBm:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos7dBm));
            break;

        case RADIO_TXPOWER_TXPOWER_Pos6dBm:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos6dBm));
            break;

        case RADIO_TXPOWER_TXPOWER_Pos5dBm:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos5dBm));
            break;

        case RADIO_TXPOWER_TXPOWER_Pos2dBm:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos2dBm));
            break;

#endif // defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
        case RADIO_TXPOWER_TXPOWER_Pos4dBm:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(RADIO_TXPOWER_TXPOWER_Pos4dBm));
            break;

